In [43]:
import pandas as pd
from sqlalchemy import create_engine

In [44]:
from etl_clean_ip import top30_disparity
from etl_clean_ip import avgincome_perzip
from etl_clean_ip import home_value_byzip
from yelp import restaurants_clean

In [45]:
avgincome_perzip = avgincome_perzip.rename(columns={'Avg_income':'avg_income'})

In [56]:
restaurants_clean = restaurants_clean.rename(columns={'ID':'id','Name':'name','Location':'location','City':'city','State':'state','Zipcode':'zipcode','Rating':'rating','Price':'price'})

In [57]:
avgincome_perzip = avgincome_perzip.reset_index()

In [60]:
restaurants_clean = restaurants_clean.reset_index()

In [48]:
connection_string = "postgres:Ab2423034@localhost:5433/ETL_HW"
engine = create_engine(f'postgresql://{connection_string}')

In [34]:
engine.table_names()

['top30_disparity', 'restaurants_df', 'home_value_byzip', 'avgincome_perzip']

In [35]:
avgincome_perzip.to_sql(name='avgincome_perzip',con=engine,if_exists='append',index=True)

In [62]:
pd.read_sql_query('select * from avgincome_perzip', con=engine).head()

   index      zip          avg_income
0      0  33002.0             55473.0
1      1  33010.0  40904.846153846156
2      2  33011.0             32323.0
3      3  33012.0  44724.055555555555
4      4  33013.0            44833.75

In [61]:
restaurants_clean.to_sql(name='restaurants_df',con=engine,if_exists='append',index=False)

In [63]:
pd.read_sql_query('select * from restaurants_df', con=engine).head()

,index,id,name,location,city,state,zipcode,rating,price
0,1183,-3YZxfPp5asNj8Xa-4dRtA,El Palacio De Los Frijoles kendall,15512 SW 72nd St,Miami,FL,33193,4.5,$$
1,1165,-6CCxMhrhi6QjkEQ8p9ePw,Coopertown Restaurant,22700 SW 8th St,Miami,FL,33194,4.0,$$
2,781,-7xE_anzYV0g7SXC119lwg,Rico's Steak & Grill,18509 S Dixie Hwy,Cutler Bay,FL,33157,4.5,$$
3,125,-NKYlNaASizxqmNBgSfgeQ,Old Tom's,5001 NW 36th St,Miami Springs,FL,33166,4.0,$$
4,389,-Wu6gPfvTmpx1RKR05w41Q,Ernestos's Taco Shop,20095 S Dixie Hwy,Miami,FL,33189,4.0,$

In [67]:
top30_disparity = top30_disparity.rename(columns={'Avg_income':'avg_income'})

In [68]:
top30_disparity.to_sql(name='top30_disparity',con=engine,if_exists='append',index=False)

In [69]:
pd.read_sql_query('select * from top30_disparity', con=engine).head()

   avg_income  zip_code  home_value  rent_value  rule_of_thumb  disparity
0       35515     33142      235600        1759            888        871
1       40237     33127      281800        1934           1006        928
2       40286     33147      244200        1760           1007        753
3       41506     33125      311700        1886           1038        848
4       42845     33136      243800        1889           1071        818

In [71]:
home_value_byzip.to_sql(name='home_value_byzip',con=engine,if_exists='append',index=False)

In [72]:
pd.read_sql_query('select * from home_value_byzip', con=engine).head()

  zip_code home_value rent_value
0    33010   $321,100        ---
1    33012   $251,200     $1,807
2    33013   $341,000        ---
3    33014   $268,800     $1,892
4    33015   $271,400     $1,820